note-kc&kt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-26 Fri 16:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>kyoto Cabinet &amp; Tycoon kv 离线数据库</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">kyoto Cabinet &amp; Tycoon kv 离线数据库</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7b5816d">kyoto Cabinet &amp; Tycoon</a>
<ul>
<li><a href="#org9a5085c">install cabinet &amp; Tycoon</a></li>
<li><a href="#orgc3f5165">ktserver</a></li>
<li><a href="#org2c4c34f">ktremotemgr</a></li>
<li><a href="#orgc9b42ff">hot backup</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7b5816d" class="outline-2">
<h2 id="org7b5816d">kyoto Cabinet &amp; Tycoon</h2>
<div class="outline-text-2" id="text-org7b5816d">
<p>
官方地址：
</p>

<p>
<a href="http://fallabs.com/kyotocabinet/">http://fallabs.com/kyotocabinet/</a>
</p>

<p>
<a href="http://fallabs.com/kyototycoon/">http://fallabs.com/kyototycoon/</a>
</p>

<ul class="org-ul">
<li>以kch结尾的文件，代表使用hash表存储数据，每个操作的时间复杂度是 O(1)</li>
<li>以kct结尾的文件，代表使用B+ tree表存储数据，每个操作的时间复杂度是 O(log N),但B+ tree数据库支持对 key 顺序的连续访问，这可以实现对字符串的前向匹配查找和整数的范围查找</li>
</ul>
</div>
<div id="outline-container-org9a5085c" class="outline-3">
<h3 id="org9a5085c">install cabinet &amp; Tycoon</h3>
<div class="outline-text-3" id="text-org9a5085c">
<pre class="example">
##centos 6
#install kyotocabinet pkg
# install kc
wget http://fallabs.com/kyotocabinet/pkg/kyotocabinet-1.2.76.tar.gz
tar xzvf kyotocabinet-1.2.76.tar.gz
cd kyotocabinet-1.2.76
./configure &amp;&amp; make &amp;&amp; make install &amp;&amp; cd ..
rm kyotocabinet-1.2.76* -rf

# install python binding
wget http://fallabs.com/kyotocabinet/pythonlegacypkg/kyotocabinet-python-legacy-1.18.tar.gz
tar xzvf kyotocabinet-python-legacy-1.18.tar.gz
cd kyotocabinet-python-legacy-1.18
python setup.py install
#fix 'libkyotocabinet.so.16: cannot open shared object file: No such file or directory' error
echo "/usr/local/lib" &gt;&gt; /etc/ld.so.conf.d/usrlocal.conf
ldconfig -v &amp;&amp; cd ..
rm kyotocabinet-python-legacy-1.18* -rf
# install tycoon
wget http://fallabs.com/kyototycoon/pkg/kyototycoon-0.9.56.tar.gz
cd kyototycoon-0.9.56
sed -i '24a\#include &lt;unistd.h&gt;' ktdbext.h
./configure &amp;&amp; make &amp;&amp; make install
#fix ktserver: error while loading shared libraries: libkyototycoon.so.2: cannot open shared object file: No such file or directory
cp libkyototycoon.so.2 /usr/lib
ldconfig -v &amp;&amp; cd ..
pwd
rm kyototycoon* -rf
</pre>
</div>
</div>
<div id="outline-container-orgc3f5165" class="outline-3">
<h3 id="orgc3f5165">ktserver</h3>
<div class="outline-text-3" id="text-orgc3f5165">
<p class="verse">
-port num : 指定需要绑定的端口号。默认端口号为1978<br />
-th num : 指定线程数<br />
-le : 日志记录级别&#x2014;error<br />
-ls : 日志记录级别&#x2014;system<br />
-onl : opens the database with the no locking option.<br />
-pid file: 输出进程ID 到指定文件（这里指定文件名<br />
-plsv file :  #支持memcache需要指明共享库/usr/local/libexec/ktplugservmemc.so<br />
-plex str : #指定了可插拔服务器配置的表达 port=8902 通过memcache访问kt的端口<br />
-tout num : 指定每个会话的超时时间（单位为秒）。默认永不超时<br />
-bnum 指定哈希表的桶数量。官方推荐是记录数的两倍或者更高。   10 million : bnum=20000000<br />
-msize 指定内存映射区域大小 小于系统内存  10 million : 10G<br />
-dfunit 设定一个值，当碎片数超过这个值系统就进行碎片整理。<br />
-dmn   以daemon方式启动。<br />
</p>

<ul class="org-ul">
<li><p>
Typical Server Setting
</p>
<pre class="example">
ktserver -port 8901 \
         -th 32    \
         -log /var/log/kt_compromise.log \
         -le -onl   \
         -pid /var/log/kt_compromise.pid \
         -tout 10   \
         -plsv /usr/local/libexec/ktplugservmemc.so  \
         -plex port=8902 
         /root/data/compromise.kch#opts=l#bnum=5120000#msiz=3g#dfunit=8
</pre></li>
<li><p>
On-memory Server Setting
</p>

<p>
space efficiency of Kyoto Tycoon is better than that of memcached.
</p>

<p>
10 million records are cached in the database using 10GB memory = 每个document 1k
</p>

<p>
65% of the total memory size of the machine &gt;50%
</p>

<p>
Background Snapshot for On-memory Databases is similar to the one in Redis 
定期将内存中的数据存入到目录
</p>

<p>
If there are snapshot files when the server starts, they are read and all records are restored
</p>

<pre class="example">
ktserver -port 2000 \
          -bgs /home/lixuchun
          -bgsi 10 
          -bgsc lzo
          :#bnum=2000000#ktcapsiz=2g

每10秒钟做快照以lzo压缩到/home/lixuchun目录下

[root@ioc05 malicious.file]#  ktserver -port 2000 -bgs /home/lixuchun -bgsi 10 :#bnum=2000000#ktcapsiz=2g
2018-04-26T16:09:22.883172+08:00: [SYSTEM]: ================ [START]: pid=9629
2018-04-26T16:09:22.883322+08:00: [SYSTEM]: opening a database: path=:#bnum=2000000#ktcapsiz=2g
2018-04-26T16:09:22.883593+08:00: [SYSTEM]: starting the server: expr=:2000
2018-04-26T16:09:22.883651+08:00: [SYSTEM]: server socket opened: expr=:2000 timeout=30.0
2018-04-26T16:09:22.883668+08:00: [SYSTEM]: listening server socket started: fd=3
2018-04-26T16:09:32.901128+08:00: [INFO]: snapshotting databases
2018-04-26T16:09:43.423182+08:00: [INFO]: snapshotting databases
2018-04-26T16:09:53.946827+08:00: [INFO]: snapshotting databases
2018-04-26T16:10:04.469418+08:00: [INFO]: snapshotting databases

ktremotemgr set  -port 2000  france paris
ktremotemgr list  -port 2000

</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org2c4c34f" class="outline-3">
<h3 id="org2c4c34f">ktremotemgr</h3>
<div class="outline-text-3" id="text-org2c4c34f">
<pre class="example">
插入数据
ktremotemgr set -host 127.0.0.1 -port 8901 manue1 360
查询
ktremotemgr get -host 127.0.0.1 -port 8901 manue1
删除
ktremotemgr remove -host 127.0.0.1 -port 8901 manue2
列出所有key
ktremotemgr list -host 127.0.0.1 -port 8901 
</pre>
</div>
</div>
<div id="outline-container-orgc9b42ff" class="outline-3">
<h3 id="orgc9b42ff">hot backup</h3>
<div class="outline-text-3" id="text-orgc9b42ff">
<ol class="org-ol">
<li><p>
dbbackup.sh It must have executable permissions
</p>

<pre class="example">
#! /bin/sh
srcfile="$1"
destfile="$1.$2"
cp -f "$srcfile" "$destfile"
</pre></li>
<li><p>
ktserver -cmd  -ulog  set
</p>

<pre class="example">
ktserver -port 1978 \
         -th 32    \
         -log /var/log/kt_malfile.log  \
         -sid 1 \
         -ulog /var/log/backup_update_log \
         -cmd /home/s/apps/malicious.file/tools \
         -li  \
         -pid  /var/log/kt_malfile.pid \
         -tout 10   \
         -onl   \
         -plsv /usr/local/libexec/ktplugservmemc.so  \
         -plex port=1979 \
         /root/data/malfile.kch#opts=l#bnum=5120000#msiz=3g#dfunit=8
</pre></li>
<li><p>
ktremotemgr make a backup file  
</p>

<pre class="example">
ktremotemgr  sync -cmd dbbackup.sh
</pre></li>
<li><p>
recover kt data
</p>

<p>
$1 is interactive arg : 01524834405899000000
</p>
<pre class="example">
rm  /root/data/malfile.kch -f
cp   /root/data/malfile.kch.$1  /root/data/malfile.kch
kttimedmgr recover -ts $1 /root/data/malfile.kch /var/log/backup_update_log
#rm /var/log/backup_update_log/* -f
</pre></li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>